import Marquee from "react-fast-marquee";
// import { Link } from "react-router-dom";

const BreakingNews = () => {
  return (
    <div className="flex bg-[#F3F3F3] my-4 py-3 pl-3">
      <button className="px-6 py-2 text-white bg-[#D72050]">Latest</button>
      <Marquee pauseOnHover={true} speed={100}>
        ঢাকা: প্রধানমন্ত্রী শেখ হাসিনা বলেছেন, আন্দোলনের নামে আগামী জাতীয়
        নির্বাচনের আগে ২০১৩-১৪ সালের মতো অগ্নিসন্ত্রাস এবং অমানবিক নৃশংসতার ঘটনা
        ঘটালে আর কোনো সহনশীলতা দেখানো হবে না। সাধারণ মানুষের ওপর হামলা বা হামলার
        ঘটনা ঘটলে রেহাই দেওয়ার কোনো সুযোগ থাকবে না। ২ অক্টোবর লন্ডনের মেথোডিস্ট
        সেন্ট্রাল হল ওয়েস্টমিনস্টারে তার সম্মানে আয়োজিত একটি কমিউনিটি সংবর্ধনায়
        তিনি এ কথা বলেন। খালেদা জিয়ার বিদেশে চিকিৎসা প্রসঙ্গে শেখ হাসিনা বলেন,
        বাংলাদেশের সবচেয়ে দামি হাসপাতালে থেকে চিকিৎসা নিচ্ছেন। আর রোজই শুনি এই
        মরে মরে, এই যায় যায়। তো বয়স তো আশির ওপরে, এমনি তো মৃত্যুর সময় হয়ে গেছে,
        তার মধ্যে অসুস্থ, তো এখানে এত কান্নকাটি করে তো লাভ নাই। খালেদা জিয়াকে
        চিকিৎসার জন্য বিদেশে পাঠানোর ক্ষেত্রে তার কিছুই করার নেই উল্লেখ করে
        প্রধানমন্ত্রী বলেন, তিনি আইন অনুযায়ী যা করতে পারেন তাই করেছেন। অনেকেই
        এখন যুক্তি দিচ্ছেন, ‘আইন নিজের গতিতে চললেও খালেদা জিয়ার প্রতি আমি বেশি
        সহানুভূতি দেখাতে পারি’। ১৫ আগস্ট, ১৯৭৫ সালের হত্যাকাণ্ড, ২১ আগস্ট, ২০০৪
        গ্রেনেড হামলা, শেখ রেহানার বাড়িটিকে একটি পুলিশ ফাঁড়িতে পরিণত করা, যা
        তিনি জাতির পিতার পরিবারের সদস্যদের নিরাপত্তা দেওয়ার জন্য প্রণীত আইনের
        অধীনে পেয়েছিলেন এবং তা বিএনপি সরকারের লংঘনের ঘটনা উল্লেখ করেন। ছেলে
        কোকোর মৃত্যুর পর তাকে (শেখ হাসিনা) খালেদা জিয়ার বাড়িতে প্রবেশের অনুমতি
        না দেবার কথা উল্লেখ করে প্রধানমন্ত্রী বলেন, তারা কীভাবে খালেদা জিয়ার
        জন্য আমার কাছ থেকে আরও সহানুভূতি আশা করে। প্রধানমন্ত্রী দেশবাসীকে স্মরণ
        করিয়ে দেন যে বিএনপি-জামায়াত জোট ২০১৩-১৪ সালে যাত্রীবাহী বাস, ট্রেন ও
        লঞ্চসহ বহু ধরনের যানবাহনে পেট্রোল বোমা নিক্ষেপ করে জনগণকে জীবন্ত পুড়িয়ে
        হত্যা করে, সরকারি ও বেসরকারি সম্পত্তি ধ্বংস করে সারা দেশে তাণ্ডব
        চালিয়েছিল। তথাকথিত আন্দোলনের নামে। তিনি বলেন, অগ্নিসংযোগের ঘটনায় নারীসহ
        অনেক লোক গুরুতরভাবে দগ্ধ হয়েছিলো এবং তারা তাদের আঘাত নিয়ে অমানবিক
        জীবনযাপন করছে। প্রধানমন্ত্রী বলেন, আন্দোলনে আমাদের কোনো আপত্তি নেই।
        সন্ত্রাস অগ্নিসংযোগ করে মানুষ হত্যা এবং দেশের সম্পত্তি নষ্ট করা তাদের
        আন্দোলন। এর আগে ২৯ জন পুলিশ সদস্যকে হত্যা করেছে। দুর্দশাগ্রস্ত মানুষের
        জীবন নিয়ে এমন কোনো চেষ্টা করা হলে কোনো ক্ষমা করা হবে না।{" "}
      </Marquee>
    </div>
  );
};

export default BreakingNews;
